# 빈 자리는 빈 공간으로 두고, 오른쪽 정렬을 하되, 총 10자리 공간을 확보한다. 
print("{0: > 10}" .format(500))

# 양수일 때는 +로 표시, 음수일 때 -로 표시한다. 
print("{0: >+10}" .format(500))
print("{0: >+10}" .format(-500))

# 왼쪽 정렬하고, 빈칸으로 _로 채운다. 
print("{0:_<+10}" .format(500))

# 3자리 마다 콤마를 찍어주기
print("{0:,}" .format(10000000000))

# 3자리 마다 콤마를 찍어주기. +- 부호도 붙이기 
print("{0:+,}" .format(100000000000))
print("{0:+,}" .format(-100000000000))

# 3자리 마다 콤마를 찍어주기, 부호도 붙이고, 자릿수도 확보한다. 
# 돈이 많으면 기분이 좋네. 빈 자리는 ^로 채운다. 
print("{0:^<+30,}" .format(100000000000))
# 소수점을 출력 
print("{0:f}" .format(5/3))

# 소수점 특정 자리수 까지만 표시하기 (소수점 3째 자리에서 반올림한다.) 
print("{0:.2f}" .format(5/3))